CUSTOMER DSECT
*NAME    DS CL4 
*NAME    DS CL5 
*ALANCE  DS PL5 

MAIN     CSECT 

DSECT    SUBENTRY
*...
         USING CUSTOMER,R7 
*        LA 7,TABLE 
*        MVC NAME1,FNAME 
*        MVC NAME2,LNAME 

         L  15,=X'00000000'
         BR 14

         SUBEXIT
*... 
*ABLE    EQU * 
*        DC CL4'FRED' 
*        DC CL5'SMITH' 
*        DC PL5'432.98' 
*... 
*AME1    DS CL10 
*AME2    DS CL20

AFIELD   DC F'4'     AFIELD = X'00000004'

         END