DSECTS   SUBENTRY
CUSTOMER DSECT
FNAME    DS CL4 
LNAME    DS CL5 
BALANCE  DS PL5 

MAIN     CSECT 
*...
         USING CUSTOMER,R7 
         LA R7,TABLE 
         MVC NAME1,FNAME 
         MVC NAME2,LNAME 

         SUBEXIT
*... 
TABLE    EQU * 
         DC CL4'FRED' 
         DC CL5'SMITH' 
         DC PL5'432.98' 
*... 
NAME1    DS CL10 
NAME2    DS CL20

         END